import { BuildAllTranslationPages, WelcomePageLanguageTranslationBuilder } from "../translation-builders";

const welcome_page = new WelcomePageLanguageTranslationBuilder(
    'Платформа для вивчення англійської мови',
    'Активні користувачі',
    'Наша мета 🎯',
    'Наша платформа призначена для надання комплексних ресурсів та інструментів, які допоможуть вам покращити свою володіння англійською мовою.',
    'Завжди оновлюється 🔄',
    'Наші граматичні відомості та словник регулярно оновлюються, щоб ви мали доступ до найновішої та найточнішої інформації.',
    "Структура платформи 🗂",
    "Крок 1",
    "Крок 2",
    "Крок 3",
    "Крок 4",
    "Визначте свій рівень",
    "Вивчіть граматику",
    "Пройти тести",
    "Використовуйте словник із параметрами прослуховування слів",
    "Як користуватися платформою для навчання англійської мови? 🤔",
    "Відгуки наших учнів🎓",
    "Привіт! Я просто хотів сказати, що English Learning Platform стала для мене паличкою-виручалочкою. Інформація про граматику є чіткою та легкою для розуміння, а тести допомогли мені виявити свої слабкі сторони та покращити свої знання англійської мови."
);

const UA_TRANSLATION_BUILD = new BuildAllTranslationPages(welcome_page, "UA").buildTranslationObject();

export default UA_TRANSLATION_BUILD;
