import LanguageTranslationBuilder from "../translation-builder";

const UA = new LanguageTranslationBuilder(
  'Платформа для вивчення англійської мови',
  'Активні користувачі',
  'Наша мета 🎯',
  'Наша платформа призначена для надання комплексних ресурсів та інструментів, які допоможуть вам покращити свою володіння англійською мовою.',
  'Завжди оновлюється 🔄',
  'Наші граматичні відомості та словник регулярно оновлюються, щоб ви мали доступ до найновішої та найточнішої інформації.',
  "Структура платформи",
);

export default UA;
